[
  {
    "id": 1,
    "title": "QA Automation Engineer – Web & API Testing (SaaS, PDF Workflows)",
    "type": " Full-time",
    "posted": "2025-09-20",
    "views": 452,
    "about": "We are seeking a QA Automation Engineer to join our growing product development team for RLS, a multi-tenant SaaS application used by life sciences companies to manage, annotate, redact, and transform text within PDF documents.This role is ideal for someone who enjoys automating complex user workflows, especially those involving PDF rendering, search/replace functionality, and REST API-driven web applications.You will lead our efforts in automating test cases, ensuring release quality, and building a scalable QA infrastructure to catch issues early and often.",
    "responsibilities": [
      "Design and implement automated E2E test cases using Playwright (or similar) for PDF workflows such as load, search, redaction, annotation, and save",
      "Build integration tests for REST APIs (Node.js backend) and validate key workflows like authentication, project/task creation, and S3 interactions",
      "Maintain and expand component-level tests for React-based UI using tools like React Testing Library and Jest",
      "Develop and run test suites in CI/CD pipelines (e.g., GitHub Actions)",
      "Set up and manage test data across multiple tenant schemas (PostgreSQL on AWS RDS)",
      "Implement visual regression tests to detect rendering issues in WebViewer",
"Work closely with developers, product managers, and devops engineers to identify edge cases and proactively address quality risks",
"Optionally, leverage AI-assisted test tools (like Testim.io, QA Wolf, Claude, or GitHub Copilot) to accelerate test development"

    ],
    "requirements": [
     " 3+ years of experience in QA automation for web applications Strong knowledge of Playwright, Cypress, or Selenium for browser-based E2E testing",
"Experience testing RESTful APIs with tools like Postman, Supertest, or Newman",
"Familiarity with JavaScript/TypeScript and modern test frameworks (Jest, Mocha)",
"Experience with PDF testing challenges, e.g., validating content after edits",
"Understanding of CI/CD systems (GitHub Actions, Bitbucket Pipelines, or similar)",
"Exposure to AWS services like S3, RDS, ECS, and Cognito",
"Comfortable working in a fast-paced, agile SaaS environment"
    ],

    "qualification":[
"Experience testing RESTful APIs with tools like Postman, Supertest, or Newman",
"Familiarity with JavaScript/TypeScript and modern test frameworks (Jest, Mocha)",
"Experience with PDF testing challenges, e.g., validating content after edits",
"Understanding of CI/CD systems (GitHub Actions, Bitbucket Pipelines, or similar)",
"Exposure to AWS services like S3, RDS, ECS, and Cognito",
"Comfortable working in a fast-paced, agile SaaS environment"
    ],
"Offer":[
" An opportunity to shape the QA process of a core product used by leading pharmaceutical companies",
" Work with modern technologies (React, Node, AWS, Playwright, Apryse)",
" Competitive compensation and flexible remote work environment",
" A collaborative and learning-oriented engineering team"
],
    
    "schedule": [],
    "education": [],
    "experience": [],
    "employmentType": [],
    "industry": [],
    "contactEmail": []
  },
  {
    "id": 2,
    "title": "Sales Manager",
    "type": " On-Site",
    "posted": "2 years ago",
    "views": 659,
    "about": "A sales manager manages an organization’s entire sales process. They are responsible for supervising sales plans and the performance of an organization to achieve the expected growth. Their duties include developing sales strategies, evaluating the effectiveness of sales teams across various locations, and overseeing team members’ performance.",
    "responsibilities": [
      "A sales manager typically functions as the head of the sales department to manage organizational sales at various levels. They create strategic plans to extend the sales reach of the organization and execute the plans to grow the customer base. Setting up sales quotas for sales teams and ensuring that the quota is met or exceeded is the responsibility of a sales manager. They monitor the output of sales representatives and guide the representatives to achieve sales allocations for optimal growth. Figuring out the gaps between teams and providing them with the necessary resources to meet those gaps is also the duty of a sales manager.",
      "Achieve growth and hit sales targets by successfully managing the sales team",
      "Design and implement a strategic business plan that expands company’s customer base and ensure it’s strong presence",
"Own recruiting, objectives setting, coaching and performance monitoring of sales representatives",
"Build and promote strong, long-lasting customer relationships by partnering with them and understanding their needs",
"Present sales, revenue and expenses reports and realistic forecasts to the management team"
    ],
    "requirements": [
      "BS/MS degree in business administration or a related field",
"Successful previous experience as a sales representative or sales manager, consistently meeting or exceeding targets",
"Committed to continuous education through workshops,seminars and conferences",
"Demonstrated ability to communicate, present and influence credibly and effectively at all levels of the organization",
"Proven ability to drive the sales process from plan to close Strong business sense and industry expertise",
"Excellent mentoring, coaching and people management skills"
    ],
    "qualification":[],
    "Offer":[],
    "schedule": "Dayshift, Monday to Friday",
    "education": "BS/MS degree in business administration or a related field",
    "experience": "Minimum 1 year Relate field",
    "employmentType": "Full-time",
    "industry": [],
    "contactEmail": "info@vm3techsolution.com"
  },
  {
    "id": 3,
    "title": "Shopify Developer",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "812 views",
    "about": "We are looking for Shopify developers who are comfortable programming on the Shopify platform. They should have development experience, in-depth understanding, and distinct perspectives of all things to specialize in all the Shopify projects.The chosen candidate should be able to create a bespoke development using the existing Shopify templates. Besides that, they must also know how to convert mock-ups and specifications into complete functional solutions.He/she must also know how to update and modify the existing websites to enhance the UX/UI design or add new features. They must also know how to test and develop 3rd-party Shopify apps and customize and create Shopify accounts.",
    "responsibilities": [
      "Make knowledgeable and engaging Shopify store online to increase the revenue and sales.",
"Make bespoke themes and change all the pre-existing templates according to the predefined company guidelines.",
"Should be a professional in all areas of the E-commerce platform.",
"Work with the UI and UX design teams to make the inventive, strong, and unique user experience.",
"Ensure smooth connection with the Shopify Apps, Marketing Tools, and Platform APIs.",
"Must debug and test out the websites regularly to enhance the performance.",
"Offer coordination and technical support to protect the company against failure.",
"Increase the conversion rates by optimizing websites."
    ],
    "requirements": [
      "Bachelor’s degree in Design or related field",
      "Proficiency in Figma, Adobe XD"
    ],
    "qualification": [
"Bachelor’s degree in Computer Science, Information Technology, or any other similar field.",
"Must have maintenance, launch, and shop construction expertise and also have a general understanding of the admin system.",
"Expert in JavaScript, DOM, CSS3 and HTML5.",
"Has previous experience in Storefront API and working with custom theme.",
"Has working knowledge in liquid templating and theming system of Shopify.",
"Previous experience in debugging or implementing 3rd-party Shopify applications and making unique solutions when it’s required.",
"Must carry expertise and knowledge with jQuery, current frameworks of JavaScript, vanilla JavaScript, and ES2015/ES6.",
"Must carry working knowledge of Shopify properties or objects, Meta fields, and AJAX API.",
"Must possess debugging and testing abilities utilizing browser console and various other tools.",
"Must have the ability to provide proactive feedback and interact effectively.",
"Working knowledge in 3rd-party APIs and services along with Shopify plugins.",
"Previous experience in creating responsive and unique layouts for mobile devices, tablets, and desktop." 
 ],
    "Offer": [],
    "offer":[],
    "schedule": "Day shift, Monday to Friday",
    "education":[],
    "experience":"Minimum 6 Months Relate field",
    "employmentType":"Full-time",
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  },
  {
    "id": 4,
    "title": "UI/UX Designer",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "1,504 views",
    "about": "We are looking for a dynamic UI/UX designer who will be responsible for the user experience (UX) and user interface (UI) design of our various digital assets. You will ensure that all elements of the online user experience are optimized for improved usability, usefulness, and exceptional visual design. The successful candidate will evidence a passion for delivering adaptive and creative solutions to UI/UX design problems by staying up to date with best practices and emerging trends in user experience design and user interface technology..",
    "responsibilities": [
" Investigating user experience design requirements for our suite of digital assets.",
"Developing and conceptualizing a comprehensive UI/UX design strategy for the brand.",
"Producing high-quality UX design solutions through wireframes, visual and graphic designs, flow diagrams, storyboards, site maps, and prototypes.",
"Designing UI elements and tools such as navigation menus, search boxes, tabs, and widgets for our digital assets.",
"Testing UI elements such as CTAs, banners, page layouts, page designs, page flows, and target links for landing pages.",
"Collaborating with the marketing team, and internal and external designers to ensure the creation and delivery of tailored experiences for the digital user.",
"Providing advice and guidance on the implementation of UX research methodologies and testing activities in order to analyze and predict user behavior.",
"Adhering to style standards on typography and graphic design."
    ],
    "requirements": [
"A bachelor’s degree and a minimum of 0-6Months   UI/UX design experience for digital products or services.",
"A portfolio of professional UI/UX design work for both web and mobile platforms.",
"Working knowledge of the following technologies and software: Sketch, In Vision, Visio, Figma, Miroboard, Fig jam.",
"A team player but can work independently too.",
"Excellent written and verbal communication skills.",
"Multi-tasking and time-management skills, with the ability to prioritize tasks."
    ],
    "qualification": [],
    "Offer": [],
    "offer":[],
    "schedule": "Day shift, Monday to Friday",
    "education":[],
    "experience":"Minimum 6 Months Relate field",
    "employmentType":"",
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  },
  {
    "id": 5,
    "title": "Back Office Executive",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "952 views",
    "about": "We are looking to hire an Intern back office executive to join our busy back office team. As a back office executive, you will be reporting to the back office manager and assisting with various administrative duties. This includes data management, project processing, market research, data analysis, finances, and administrative duties.To ensure success as a back office executive, you should have extensive experience in office management, the ability to work as part of a team, and the ability to respond quickly to requests from management. Ultimately, a top-class back office executive works quickly and efficiently to provide reliable support for management and the front office team.",
    "responsibilities": [
"      Performing market research.",
"Gathering and processing research data.",
"Performing basic admin duties including printing, sending emails, and ordering office supplies.",
"Assisting and coordinating with the sales team.",
"Assisting the Front Office team.",
"Assisting with inventory control.",
"Organizing staff meetings and updating calendars.",
"Processing company receipts, invoices, and bills.",
"Assisting and supporting management."
    ],
    "requirements": [
"Bachelor’s degree in business administration or similar field.",
"Excellent organizational skills.",
"Knowledge of computer operating systems and MS Office software.",
"Working knowledge of CRM platforms.",
"Ability to work as part of a team.",
"High-level written and verbal communication skills.",
"Basic knowledge of financial and accounting software.",
"Familiarity with market research techniques."
    ],
    "qualification": [],
    "Offer": [ ],
    "offer": [],
    "schedule": "Day shift, Monday to Friday",
    "education":[],
    "experience":"Fresher's can Apply",
    "employmentType":"Full-time",
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  },
  {
    "id": 6,
    "title": "HR Intern",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "783 views",
    "about": "We are looking to employ an enthusiastic and driven HR intern to assist our HR department with administrative and HR-related tasks. The HR intern’s responsibilities include updating employee absence records, filing HR documents accordingly, initiating background checks on shortlisted candidates, and providing suitable recommendations to improve HR policies. You should also be able to draft employee communications notifying staff of policy and procedural changes.To be successful as an HR intern, you should keep abreast of the latest developments in labour legislation to determine how company HR policies may be affected. Ultimately, an outstanding HR intern should be detail-oriented and able to demonstrate excellent administrative and organizational skills.",
    "responsibilities": [
"Updating company databases by inputting new employee contact information and employment details.",
"Screening potential employees’ resumes and application forms to identify suitable candidates to fill company job vacancies.",
"Organizing interviews with shortlisted candidates.",
"Posting job advertisements to job boards and social media platforms.",
"Removing job advertisements from job boards and social media platforms once vacancies have been filled.",
"Assisting the HR staff in gathering market salary information.",
"Assisting in the planning of company events.",
"Preparing and sending offer and rejection letters or emails to candidates.",
"Coordinating new hire orientations.",
"Responding to staff inquiries regarding HR policies, employee benefits, and other HR-related matters."
  ],
"requirements": [
"Bachelor’s degree in human resource management or studying toward a degree in human resource management or related field.",
"Proven experience working in an office environment.",
"Familiarity with HRIS (Human Resources Information System) software is advantageous.",
"Proficiency in all Microsoft Office applications.",
"The ability to work as part of a team.",
"Strong analytical and problem-solving skills.",
"Excellent administrative and organizational skills.",
"Effective communication skills.",
"Detail-oriented."
 ],
  "qualification": [],
    "Offer": [],
    "offer": [],
    "schedule": "Day shift, Monday to Friday",
    "education":[],
    "experience":"Minimum 6 Months Relate field",
    "employmentType":"Full-time",
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  },
  {
    "id": 7,
    "title": "Web Developer",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "1,029 views",
    "about": "We are looking for Web Developer to be responsible for the coding, innovative design and layout of our website. Web developer responsibilities include building our website from concept all the way to completion from the bottom up, fashioning everything from the home page to site layout and function.",
       "responsibilities": [
"Write well designed, testable, efficient code by using best software development practices",
"Create website layout/user interface by using standard HTML/CSS practices",
"Integrate data from various back-end services and databases",
"Gather and refine specifications and requirements based on technical needs",
"Create and maintain software documentation",
"Be responsible for maintaining, expanding, and scaling our site",
"Stay plugged into emerging technologies/industry trends and apply them into operations and activities",
"Cooperate with web designers to match visual design intent"
 ],
    "requirements": [
"Proven working experience in web programming",
"Familiarity with at least one of the following programming languages: PHP, ASP.NET, Javascript.",
"A solid understanding of how web applications work including security, session management, and best development practices",
"Adequate knowledge of relational database systems, Object Oriented Programming and web application development",
"Hands-on experience with network diagnostics, network analytics tools"
    ],
    "qualification": [],
    "Offer": [],
   "offer": [],
    "schedule": "Day shift, Monday to Friday",
    "education":[],
    "experience":"Minimum 6 Months Relate field",
    "employmentType":"Full-time",
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  },
  {
    "id": 8,
    "title": "Content Writer",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "696 views",
    "about": "We are looking for a Content Writer to join our Growing team and enrich our websites with new blog posts, guides and marketing copy.Content Writer responsibilities include conducting thorough research on industry-related topics, generating ideas for new content types and proofreading articles before publication. If you’re familiar with producing online content and have an eye for detail, we’d like to meet you. Feel free to share samples of your work or portfolio of your published articles, along with your application.Ultimately, you’ll deliver quality writing pieces that appeal to our audiences, attract customers and boost brand awareness.",
    "responsibilities": [
"Research industry-related topics (combining online sources, interviews and studies)",
"Write clear marketing copy to promote our products/service",
"Prepare well-structured drafts using Content Management System",
"Proofread and edit blog posts before publicatio",
"Coordinate with marketing and design teams to illustrate article",
"Conduct simple keyword research and use SEO guidelines to increase web traffic",
"Promote content on social media",
"Identify customers’ needs and gaps in our content and recommend new topics",
"Ensure all-around consistency (style, fonts, images and tone)"
    ],
    "requirements": [],
    "qualification": [
"Proven work experience as a Content Write or similar role",
"Portfolio of published articles",
"Experience doing research using multiple sources",
"Familiarity with web publications",
"Excellent writing and editing skills in English",
"Hands-on experience with Content Management Systems (e.g. WordPress)",
"Ability to meet deadlines."
    ],
    "Offer": [],
"offer":[],
    "schedule": "Day shift, Monday to Friday",
    "education":"Graduate",
    "experience":"Minimum 6 Months Relate field",
    "employmentType":"Full-time",
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  },
  {
    "id": 9,
    "title": "Tele Caller",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "661 views",
    "about": "Your main goal is to communicate with our potential clients and provide them the right knowledge in simple and easy language. As a Tele caller,you are responsible for handling queries of customers over the phone entirely and collect desired information from the clients. You are also required to write down important information provided by the customer and follow up with them on a regular basis.",
    "responsibilities": [
"As a tele-caller you are responsible for handling incoming calls, and making only few calls in efficient and effective manner.",
"Answering  phones and explaining the services offered by the company.",
"Contacting existing customers as well as prospective customers using scripts.",
"Obtaining customer information and other relevant data.",
"Asking questions to the customer and understanding their specifications.",
"Resolving queries and issues related to the services.",
"Maintaining the database of the customers on a regular basis, follow the system formaintaining database, and provide report to management.",
"Suggesting solutions based on customer’s needs and requirements."
    ],
    "requirements": [],
    "qualification": [
"Graduation in any field. Well-versed with computers.",
"Work experience as a Tele caller, Tele Marketer, or a similar role in the Sales Department",
"Great interpersonal skills.",
"Exceptional oral and written communication skills.",
"Strong organizational skills.",
"Ability to work in a team or individually as and when required.",
"Ability to manage and handle multiple tasks.",
"Punctuality of time is very vital."
    ],
    "Offer": [],
"offer": ["job Type",
"Full-time"],
    "schedule": "Day shift, Monday to Friday",
    "education":"Any Bachelor's Degree",
    "experience":"Fresher's can Apply for tele-calling.",
    "employmentType":"Full-time",
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  },
  {
    "id": 10,
    "title": "Business Development Manager",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "661 views",
    "about": "Our growing company needs an experienced and resourceful Business Development Manager to develop and implement growth opportunities in existing and new markets. We are searching for professionals that have a solid track record of creating long-term value for organizations. We are looking for manager who is customer-obsessed and ready to solve the changing needs of our clients. Candidates should have strong communication and leadership skills, as well as the ability to manage a diverse team",
    "responsibilities": [
"Communication with our elite customers and generate the value through zoom meeting, telephonic talk, or personal meetings.",
"Foster and develop relationships with existing or potential customers/clients.",
"Understand the needs of our customers and beagle to respond effectively.",
"Work strategically-carrying out necessary planning in order  to implement operational changes.",
"Have a good understanding of the businesses’ services and beagle to advise others about them.",
"Providing trainings to team members.",
"Discuss promotional strategy and activities with the management."
    ],
    "requirements": [
"Bachelor’s degree in business related field.",
"Drive to see knew business and meet or exceed targets.",
"Anexcellenttelephonemannerformakinginitialcontactandforongoingcommunicationwithcustomersandbusinessassociates.",
"Inter personal skills for building and developing relationships with clients.",
"Written and verbal communications kills-needed for communicating with arange of people, both internally and externally, as well as presentations kills.",
"IT skills, including the use of spreadsheets.",
"Team working skills and a collaborative approach to work.",
"Decision-making skills.",
"The ability to motivate yourself and set your own goals.",
"Punctuality of time is very vital."
    ],
    "qualification": [],
    "Offer": [],
"offer":[
  "Travelling",
" Candidate shall be ready to travel",
"Education",
"Any Bachelor’s degree."
],
    "schedule": "Day shift, Monday to Friday",
    "education":"Any Bachelor's Degree in Business realated field",
    "experience":"Minimum 2 year Relation to sales",
    "employmentType":"Full-time",
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  },
  {
    "id": 11,
    "title": "Video Editor",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "712 views",
    "about": "We are looking for a talented Video Editor to assemble recorded footage into a finished project that matches director’s vision and is suitable for broadcasting.Ultimately, as a Film and Video Editor, you should be able to bring sight and sound together in order to tell a cohesive story",
    "responsibilities": [
"Manipulate and edit film pieces in a way that is invisible to the audience",
"Take a brief to grasp production team’s needs and specifications",
"Review shooting script and raw material to create a shot decision list based on scenes’ value and contribution to continuity",
"Trim footage segments and put together the sequence of the film",
"Input music, dialogues, graphics and effects",
"Create final cuts",
" Ensure logical sequencing and smooth running",
" Consult with stakeholders from production to post-production process",
" Continuously discover and implement new editing technologies and industry’s best practices to maximize efficiency."
 ],
    "requirements": [],
    "qualification": [
"Proven work experience as a Video Editor",
"Solid experience with digital technology and editing software packages",
"Demonstrable video editing ability with a strong portfolio",
"Thorough knowledge of timing, motivation and continuity",
"Familiarity with special effects, 3D and compositing",
"Creative mind and storytelling skills",
"Bachelor Degree in a related field such as file, media and broadcasting or video production"
    ],
    "Offer": [],
"offer": [
"Benefits",
"Paid sick time"],
    "schedule": "Day shift",
    "education":[
" Graduate",
"Diploma in film Editing, Diploma in Digital Video Editing",
"Certificate Course in Editing Technology",
"Bachelor Degree in a related field such as file, media and broadcasting or video production",
"fluent English (Required)"
    ],
    "experience":[],
    "employmentType":"Full-time",
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  },
  {
    "id": 12,
    "title": "Brand Manager",
    "type": "On-site",
    "posted": "2 years ago",
    "views": "701 views",
    "about": "We are looking for an experienced Brand Manager to help us build our brand and raise brand awareness. You’ll work across all levels and departments of our organization to find what makes us unique and communicate it to the world.",
    "responsibilities": [
"You should have relevant experience in Brand growth, Product growth, Product Packaging, colour",
"Must have worked on Brand Communication, positioning Social Media presence and growth",
"Should have relevant experience in New Product Launch, New Brand Development, and New Range launch.",
"Should have took Consumer Insights and relationship management",
"Market research for new opportunities",
"Optimizing existing models",
"You should have relevant experience in Brand growth, Product growth, Product Packaging.",
"responsible for developing brand strategies, promoting brand growth and expansion,implementing brand plans, and using a variety of data to drive volume and profitability. In their essence, brand managers are focused on achieving brand business objectives in the short and long term."
    ],
    "requirements": [],
    "qualification": [],
    "Offer": [],
    "offer": [],
    "schedule": "Day shift",
    "education":"Graduate",
    "experience":"1-2 years",
    "employmentType":[],
    "industry":[],
    "contactEmail":"info@vm3techsolution.com"
  }
]
